In [1]:
import pandas as pd
import random
from deflator import deflate

Building a synthetic dataset. 

Important to notice that in yearly values the date column **must** be `int` type:

In [12]:
# building yearly synthetic dataset
yearly_df = pd.DataFrame(
    {
        "date": pd.date_range(start="2000", end="2018", freq="Y")
        .strftime("%Y"),
        "value": [random.random()*100 for i in range(len(pd.date_range(start="2000", end="2018", freq="Y")))],
    }
)
yearly_df.head()

   date      value
0  2000  32.600171
1  2001  96.347394
2  2002   1.127035
3  2003  59.209113
4  2004   2.640474

In [8]:
# using the function with a yearly value deflating to  IPCA's 2005 values:

deflate(
    data_frame=yearly_df, 
    value_column="value", 
    date_column="date", 
    deflate_year=2005
).head(10)

   date      value  deflated_value
0  1970  91.655451             NaN
1  1970  28.491082             NaN
2  1970  90.890203             NaN
3  1970  29.758559             NaN
4  1970  56.810001             NaN
5  1970  76.562463             NaN
6  1970  78.226989             NaN
7  1970  15.426460             NaN
8  1970  92.893549             NaN
9  1970  42.247219             NaN

When using monthly values, the date column **must** have the **"YYYY-MM"** format as `object`:

In [5]:
# monthly synthetic dataset:

monthly_df = pd.DataFrame(
    {
        "date": pd.date_range(start="2001", end="2006", freq="M").strftime("%Y-%m"),
        "value": [
            random.random()*100
            for i in range(len(pd.date_range(start="2001", end="2006", freq="M")))
        ],
    }
)
monthly_df.head()

      date      value
0  2001-01  88.342125
1  2001-02  45.803182
2  2001-03  43.971694
3  2001-04  49.578417
4  2001-05  94.904037

In [6]:
#deflating the series to IPCA's 2001-04 values:
deflate(
    data_frame=monthly_df,
    value_column="value",
    date_column="date",
    deflate_year=2001,
    deflate_month=4,
).head(10)

      date      value  deflated_value
0  2001-01  88.342125       89.891987
1  2001-02  45.803182       57.751838
2  2001-03  43.971694       67.114691
3  2001-04  49.578417       49.578417
4  2001-05  94.904037      134.254491
5  2001-06  51.730148       57.699011
6  2001-07  13.975527        6.094591
7  2001-08  76.867796       63.690459
8  2001-09  29.379167       60.856847
9  2001-10  13.027111        9.103283